In [3]:
import pandas as pd

# TASK:create a data set and using replace function ,replace the observations

In [4]:
data =['sai','usha','ram','teja','gopi']
num =[27, 24, 22, 26,25]
Add= ['Delhi', 'Hyd', 'vizag', 'chennai','mysore']

data = {'Name':data,'Age':num,'Address':Add}
print(data)
df = pd.DataFrame(data)
df

{'Name': ['sai', 'usha', 'ram', 'teja', 'gopi'], 'Age': [27, 24, 22, 26, 25], 'Address': ['Delhi', 'Hyd', 'vizag', 'chennai', 'mysore']}

   Name  Age  Address
0   sai   27    Delhi
1  usha   24      Hyd
2   ram   22    vizag
3  teja   26  chennai
4  gopi   25   mysore

In [6]:
#Replace column oservations
df.replace(['Delhi', 'Hyd', 'vizag', 'chennai','mysore'], [1,2,3,4,5])

   Name  Age  Address
0   sai   27        1
1  usha   24        2
2   ram   22        3
3  teja   26        4
4  gopi   25        5

In [7]:
#Replace few column names
df.replace(['usha','sai'],['ushasri','sam'])

      Name  Age  Address
0      sam   27    Delhi
1  ushasri   24      Hyd
2      ram   22    vizag
3     teja   26  chennai
4     gopi   25   mysore